AcGiVisualStyleTraits.acgiVisualStyle
Reports the visual style that is currently captured in this drawable traits.
Returns:
Returns AcGiVisualStyle const reference to the visual style that is
currently captured in this drawable traits.

AcGiVisualStyleTraits.setAcGiVisualStyle(AcGiVisualStyle!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Sets the visual style to capture in the drawable traits.
visualStyle:
Input AcGiVisualStyle const reference to the visual style to capture.

AcGiVisualStyleTraits
This class defines the visual style traits.  Derived from AcGiDrawableTraits,
this class provides the interfaces to implement for setting and returning the
visual style via drawable traits.